final dynamic ar = {
  'probot': "AskQ",
  'skip': "تخطى",
  'chatWith': "الدردشة مع Chat GPT",
  'openAiChatGpt': "OpenAI Chat GPT هي منصة ذكاء اصطناعي قوية تستخدم أحدث التقنيات الذكية.",
  'easilyGenerateImage': "توليد الصور بسهولة",
  'toReceiveTheFinest':
  "للحصول على أفضل النتائج وأداة توفير الوقت , ما عليك سوى إدخال الصورة التي تريدها وحجمها.",
  'quickCreation': "إنشاء سريع للمحتوى",
  'enterTheTitle': "أدخل العنوان الذي تريد المحتوى من أجل الحصول على أفضل نتيجة من دون نسخ , ويمكنك تعديله.",
  'quickAnswerFor': "إجابة سريعة لأي شيء تريده",
  'aBuddyWhoAvailable':
  "صديق متاح لك في جميع الأوقات للمحادثة أو الاستخدام كـ p.a.",
  'signIn': "تسجيل الدخول",
  'signUp': "تسجيل",
  'or': "أو",
  'continueAsAGuest': "المتابعة كضيف",
  'proBot': "AskQ",
  'fastResponse': "إجابة سريعة لكل ما تحتاجه",
  'welcomeBack': "مرحبًا بعودتك !!",
  'fillTheBelow': "املأ النموذج أدناه",
  'email': "البريد الإلكتروني",
  'enterEmail': "أدخل معرف البريد الإلكتروني / رقم الهاتف.",
  'password': "كلمة السر",
  'enterPassword': "أدخل كلمة المرور",
  'resetPassword': "إعادة تعيين كلمة المرور",
  'dontHaveAnAccount': "لا تملك حسابًا؟",
  'experts': "خبراء",
  'message': "رسائل",
  'chat1': "ابدأ الدردشة" ,
  'chat2': "إنشاء صورة" ,
  'chat3': "إنشاء محتوى",
  'chat4': "اختبار الدردشة",



  'continueWithGoogle': "تابع بواسطة جوجل",
  'simplyUseThis':
  "استخدم هذا الـ AskQ للحصول على المساعدة على مدار الساعة.",
  'enterYourMailOr': "أدخل بريدك الإلكتروني أو رقم هاتفك.",
  'changePassword': "تغيير كلمة المرور",
  'dontUseOneOf': "لا تستخدم أحد كلمات المرور القديمة الخاصة بك",
  'newPassword': "كلمة مرور جديدة",
  'confirmPassword': "تأكيد كلمة المرور",
  'reEnterPassword': "أعد إدخال كلمة المرور",
  'updatePassword': "تحديث كلمة المرور",
  'alreadyHaveAnAccount': "هل لديك حساب بالفعل؟ ",
  'createANewAccount': "إنشاء حساب جديد",
  'emailAlreadyUse': "البريد الإلكتروني مستخدم بالفعل",
  'unknownError': "خطأ غير معروف",
  'pleaseEnterEmail': "يرجى إدخال البريد الإلكتروني",
  'pleaseEnterValid': "يرجى إدخال بريد إلكتروني صحيح",
  'pleaseEnterPassword': "يرجى إدخال كلمة المرور",
  'passwordMustBe': "يجب أن تكون كلمة المرور 8 أحرف",
  'passwordNotSame': "كلمة المرور غير متطابقة مع كلمة المرور الخاصة بك",
  'wrongPassword': "كلمة المرور خاطئة",
  'userNotFound': "المستخدم غير موجود",
  'emailSend': "تم إرسال البريد الإلكتروني بنجاح",
  'selectLanguage': "اختر اللغة",
  'youCanChangeIt': "يمكنك تغييرها لاحقًا من الإعدادات",



  'english': "الإنجليزية",
  'french': "الفرنسية",
  'italian': "الإيطالية",
  'japanese': "اليابانية",
  'german': "الألمانية",
  'hindi': "الهندية",
  'somali': "الصومالية",
  'arabic': "العربية",
  'continues': "استمر",
  'selectCharacter': "حدد الشخصية",
  'dino': "خبير",
  'king': "كوميدي",
  'dolly': "مدرب",
  'kettie': "المسافر",
  'marvel': "فيلسوف",
  'henny': "مصمم",
  'sophie': "كاتب",
  'setupAFingerprint':
  "قم بإعداد ماسح بصمات الأصابع لزيادة أمان تطبيقك.",
  'addNow': "أضف الآن",
  'doItLater': "لاحقًا",



  "option1": "دردشة مع خبير" ,
  "option2": "مولد الصور",
  'option3': "منشئ المحتوى",
  "option4": "دردشة مع صديق",
  'desc1': "احصل على رد سريع على أي استعلام بأكثر من 80 لغة" ,
  'desc2': "أفضل النتائج , توفير الوقت لإنشاء الصور والأعمال الفنية" ,
  'desc3': "أفضل نتيجة لمنشئ المحتوى والطلاب والمشاريع" ,
  'desc4': "أفضل نتيجة لمنشئ المحتوى والطلاب والمشاريع" ,
  'chat1': "ابدأ الدردشة" ,
  'chat2': "إنشاء صورة" ,
  'chat3': "إنشاء محتوى",
  'chat4': "اختبار الدردشة",
  "الخبراء": "الخبراء" ,
  'chooseOption': "اختر واحدًا من الخيارات التالية للاستمتاع بأفضل تجربة.",
  'language': "اللغة",
  'logout': "تسجيل الخروج",
  'chat': "الدردشة",
  'content': "المحتوى",
  'setting': "الإعدادات",
  'image': "الصور",
  'darkTheme': "الوضع الداكن",
  'listCharacter': "قائمة الشخصيات",
  'tapCharacter': "اضغط على الشخصية للدردشة معها",
  'whatsapp': "واتساب",
  'insta': "إنستغرام",
  'tele': "تيليجرام",
  'fb': "فيسبوك",
  'slack': "سلاك",
  'shareToFriend': "مشاركة مع صديق",
  'okay': "حسناً",
  'deleteChat': "تم مسح كل المحادثة بنجاح.",
  'myAccount': "حسابي",
  'subscriptionPlan': "خطة الاشتراك",
  'fingerprintLock': "قفل البصمة",
  'notification': "الإشعارات",



  'darkMode': "الوضع الداكن",
  'rateApp': "تقييم التطبيق",
  'privacyTerm': "الخصوصية والشروط",
  'typeHere': "اكتب هنا...",
  'rebuildResponse': "إعادة بناء الرد",
  'shareFriend': "مشاركة مع الأصدقاء",
  'downloadChat': "تحميل المحادثة",
  'changeBackground': "تغيير الخلفية",
  'clearChat': "مسح المحادثة",
  'rtl': "RTL",
  'chatWithProBot': "الدردشة مع بروبوت",
  'businessIdea': "فكرة تجارية",
  'topic': "الموضوع",
  'exUiUx': "مثال: تصميم واجهة المستخدم/تجربة المستخدم",
  'writeContent': "كتابة المحتوى",
  'description': "النتيجة",
  'coverLetter': "رسالة تحفيزية",
  'blogSection': "قسم المدونة",
  'marketingWriting': "كتابة التسويق",
  'service': "الخدمة",




  'generateContent': "توليد المحتوى",
  'basicPlan': "الباقة الأساسية",
  'weekly': "أسبوعيًا",
  'week': "الأسبوع",
  'payNow': "ادفع الآن",
  'weekBenefit1': "الدردشة مع بروبوت",
  'weekBenefit2': "تنزيل الصور ومشاركتها مع الأصدقاء",
  'weekBenefit3': "مواضيع كتابة محتوى مجانية",
  'monthBenefit1': "تنزيل الصور ومشاركتها بشكل غير محدود",
  'monthBenefit2': "50 موضوعًا مجانيًا لكتابة المحتوى",
  'yearBenefit1': "تنزيل الصور ومشاركتها بشكل غير محدود",
  'yearBenefit2': "مواضيع كتابة محتوى مجانية بشكل غير محدود",
  'advancePlan': "الباقة المتقدمة",
  'monthly': "شهريًا",
  'month': "الشهر",
  'standardPlan': "الباقة القياسية",
  'yearly': "سنويًا",
  'year': "السنة",
  'changeCurrency': "تغيير العملة",
  'dollar': "الدولار الأمريكي",
  'euro': "اليورو",
  'inr': "INR",
  'pound': "الجنيه الإسترليني",
  'cancel': "إلغاء",
  'apply': "تطبيق",
  'unlimitedChat': "دردشة غير محدودة",
  'noOfDaysLeft': "تبقى @daysLeft يومًا فقط في الدورة.",
  'renewNow': "تجديد الآن",





  // Now
  'imageGenerator': "مولد الصور",
  'search': "بحث",
  'imageSize': "حجم الصورة",
  'viewType': "نوع العرض",
  'selectSize': "اختر الحجم",
  'selectType': "اختر النوع",
  'youHaveNotYet':
  "لم تقم بالبحث عن أي شيء بعد , ابدأ بحثك الآن.",
  'generateImage': "إنشاء صورة",
  'noOfImages': "عدد الصور",
  'imageStyle': "نمط الصورة",
  'mood': "المزاج",
  'imageColor': "لون الصورة",
  'defaults': "الافتراضي",
  'abstract': "مجرد",
  'anime': "أنمي",
  'cartoon': "رسوم متحركة",
  'comic': "كوميدي",
  'happy': "سعيد",
  'sad': "حزين",
  'angry': "غاضب",
  'color': "لون",
  'blackWhite': "أسود وأبيض",
  'neon': "نيون",
  'pageType': "نوع الصفحة",
  'gridType': "نوع الشبكة",
  'imagePreview': "معاينة الصورة",
  'share': "مشاركة",
  'download': "تحميل",




  'loading': "جارٍ التحميل ...",

  'firstName': "الاسم الأول",
  'lastName': "اسم العائلة",
  'emailPhone': "البريد الإلكتروني / الهاتف",
  'update': "تحديث",
  'enterFirstName': "أدخل الاسم الأول",
  'enterLastName': "أدخل اسم العائلة",
  'enterEmailName': "أدخل البريد الإلكتروني",
  'pleaseEnterValue': "الرجاء إدخال القيمة",
  'enterAtLeast': "أدخل على الأقل 6 أحرف",
  'newMessage': "إشعار رسالة جديدة",
  'newUpdates': "تحديثات جديدة",
  'passwordChange': "تم تغيير كلمة المرور",

  'verify': "تحقق",
  'successfullyVerify': "تم التحقق بنجاح",
  'yourFingerprintHasBeenVerify':
  "تم التحقق من بصمتك الإصبعية بنجاح.",
  'fingerprintError': "خطأ في بصمة الإصبع",
  'sorryFingerprint':
  "عذرًا !! فشل التحقق من بصمة الإصبع , يرجى المحاولة مرة أخرى ..",
  'tryAgain': "حاول مرة أخرى",
  'deviceNotSupported':
  "الجهاز غير مدعوم أو يجب إضافة بصمة إلى جهازك",
  'youHaveNotVerify': "لم تقم بعد بالتحقق من البصمة",






  'interpretationDefinitions': "تفسير وتعاريف",
  'collecting': "جمع واستخدام بياناتك الشخصية",
  'retention': "الاحتفاظ ببياناتك الشخصية",
  'transfer': "نقل بياناتك الشخصية",
  'deleteYour': "حذف بياناتك الشخصية",
  'disclosure': "كشف بياناتك الشخصية",
  'childrenPrivacy': "خصوصية الأطفال",
  'linksToOther': "روابط إلى مواقع الويب الأخرى",
  'changesToThis': "تغييرات في سياسة الخصوصية هذه",
  'thisPrivacyPolicy':
  "في تطبيق AskQ ، نقدر خصوصيتك ونلتزم بحماية معلوماتك الشخصية. توضح سياسة الخصوصية هذه كيفية جمع المعلومات واستخدامها والكشف عنها من مستخدمي ourapp. نحن لسنا مسؤولين عن ممارسات الخصوصية أو محتوى التطبيق. قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من وقت لآخر ، وسيتم نشر أي تغييرات على موقعنا WriterAi.org. اتصل بنا: إذا كانت لديك أي أسئلة أو مخاوف حول سياسة الخصوصية الخاصة بنا ، فيرجى الاتصال بنا على support@qoraai.com. تطبيق AskQ أنت توافق على سياسة الخصوصية الخاصة بن",
  'interpretation': "التفسير:",
  'theWordOfWhich':
  "الكلمات التي يتم تشكيل حرفها الأول بالحرف الكبير لها معاني محددة وفقًا للشروط التالية, ويجب أن تكون للتعاريف التالية نفس المعنى سواءً ظهرت في صيغة المفرد أو الجمع.",
  'definitions': "التعريفات:",
  'forThePurpose': "وفقًا لأغراض هذه السياسة الخصوصية:",
  'account': "الحساب",
  'meansAUnique': "يعني حساب فريد أنشأته للوصول إلى خدمتنا أو أجزاء من خدمتنا.",
  'affiliate': "شريك تابع",
  'meansAnEntity':
  "يعني كيان يتحكم فيه الطرف أو تتحكم به أو تكون تحت التحكم المشترك مع الطرف, حيث يعني 'التحكم' ملكية 50٪ أو أكثر من الأسهم أو حصة الأسهم أو الأوراق المالية الأخرى المخولة للتصويت لانتخاب مديرين أو سلطة إدارية أخرى.",
  'application': "التطبيق",
  'refersToProbot':
  "يشير إلى برنامج AskQ الذي يوفره الشركة.",
  'company': "الشركة",
  'referredToAs':
  "(المشار إليه باسم 'الشركة', 'نحن', 'نحن' أو 'لنا' في هذا الاتفاق) يشير إلى AskQ.",
  'country': "الدولة",
  'countryRefers': "يشير إلى: Jeddah, Saudi-Arabia",
  'device': "الجهاز",



  'meansAnyDevice':
  "يشير هذا المصطلح إلى أي جهاز يمكنه الوصول إلى الخدمة, مثل جهاز الكمبيوتر أو الهاتف المحمول أو الحاسوب اللوحي الرقمي.",
  'personalData': "البيانات الشخصية",
  'isAnyInformation':
  "يشير هذا المصطلح إلى أي معلومة تتعلق بشخص محدد أو قابل للتعرف.",
  'refersTo': "يشير هذا المصطلح إلى التطبيق.",
  'serviceProvider': "مزود الخدمة",
  'providerMeansAny':
  "يشير هذا المصطلح إلى أي شخص طبيعي أو معنوي يقوم بمعالجة البيانات نيابةً عن الشركة. ويشير إلى شركات أو أفراد آخرين يعملون لصالح الشركة لتيسير الخدمة أو توفيرها نيابةً عن الشركة أو تقديم خدمات متعلقة بالخدمة أو مساعدة الشركة في تحليل كيفية استخدام الخدمة.",
  'usageData': "بيانات الاستخدام",
  'refersToData':
  "يشير هذا المصطلح إلى البيانات التي يتم جمعها تلقائيًا, إما من خلال استخدام الخدمة أو من البنية التحتية للخدمة نفسها (على سبيل المثال, مدة زيارة الصفحة).",
  'you': "أنت",
  'home': "الصفحة الرئيسية",

  'meansTheIndividual':
  'تعني الفرد الذي يتم الوصول إلى الخدمة من خلاله أو استخدامها, أو الشركة, أو الكيان القانوني الآخر الذي يتم الوصول إليه أو استخدام الخدمة عن طريق هذا الفرد, حسب الاقتضاء.',

//NEW
  'phoneNumberVerification': 'التحقق من رقم الهاتف',
  'enterNumber': 'أدخل رقمك للحصول على رمز التحقق',
  'phone': 'الهاتف',
  'enterPhoneNo': 'أدخل رقم الهاتف',
  'getOTP': 'الحصول على رمز التحقق',
  'enter10Digit': 'أدخل رقم الجوال المكون من 10 أرقام',
  'loginWithPhone': 'تسجيل الدخول باستخدام الهاتف',
  'google': 'جوجل',
  'apple': 'أبل',
  'unlimited': 'غير محدود',

  'paymentSuccess': "تم الدفع بنجاح",
  'paymentFailed': "فشل الدفع",
  'congratulation':
  "تهانينا !! تم إتمام عملية الدفع الخاصة بك بنجاح.",
  'oppsDueTo':
  "عفوا !! بسبب مشكلة تقنية, فشلت عملية الدفع. يرجى المحاولة مرة أخرى.",
  'payMoneyFrom': "دفع المال من",
  'payPal': "باي بال",
  'stripe': "شريط",
  'pay': "دفع",

  'thereAreAwardLeft': "هناك @awardLeft جائزة متبقية للرسالة.",
  'chatCountText': "عدد الرسائل النصية\nالتي تم إنشاؤها",
  'imageCount': "عدد الصور\nالتي تم إنشاؤها",
  'textCompletionCount': "عدد النصوص\nالتي تم إكمالها",
  'welcome': "مرحبًا بك في AskQ",

  'balance': "الرصيد :",
  'rewards': " مكافآت",
  'availableBalance': "الرصيد المتاح",
  'rewardLeft': "المكافآت المتبقية",
  'watchTheVideoToWin':
  "شاهد الفيديو لربح جوائز إضافية ولديك المزيد من الفرص للتحدث مع AskQ.",
  'watchVideo': " شاهد الفيديو",
  'congratulationReward': "تهانينا",
  'congratulationYouGotNewReward':
  "تهانينا !! لقد حصلت على 1 مكافأة جديدة لـ AskQ الخاص بك.",
  'hurrey': "ابدأ الكتابة !",



  'youHitTheMessage': "لقد وصلت إلى الحد الأقصى للرسائل, ",
  'watchNow': " شاهد الآن",
  'clickBelow': "انقر أدناه",
  'toGet': " للحصول على",
  'orSelect': " أو حدد خطة من قائمة الإعدادات.",
  'razor': "Razorpay",
  'reward': " مكافأة",
  'noPaymentMethod': "لم يتم تنفيذ أي طريقة دفع",
  'clearSuccessFully': "تم مسح البيانات بنجاح",
  'attention': "تنبيه!",
  'enterTextBoxValue': "أدخل قيمة صندوق النص",
  'generated': "تم إنشاؤه",
  'pleaseWaitFor': "يرجى الانتظار لتحميل الصورة",
  'chatBot': "روبوت المحادثة",
  'yourImageGenerator': "انتهى رصيد إنشاء الصور الخاص بك",
  'yourContentWriting': "انتهى رصيد كتابة المحتوى الخاص بك",





  'otpVerification': 'التحقق من رمز OTP',
  'weHaveSentTheCode': 'لقد أرسلنا رمز التحقق إلى رقم هاتفك المحمول',
  'verifyProceed': 'التحقق والمتابعة',
  'dontReciveOtp': 'لم تتلقى رمز التحقق؟',
  'resendIt': 'إعادة إرساله',
  'enterValidNumber': 'أدخل رقمًا صحيحًا',
  'selectCountry': 'اختر الدولة',
  'chatHistory': 'سجل المحادثة',


  'whatIsApp': 'كيف أقول" مرحبا! " بالإسبانية؟',
  'min2': 'منذ 2 دقائق',
  'howToMake': 'قل لي نكتة مضحكة عن حلوى الصحراء!',
  'min50': 'منذ 50 دقيقة',
  'whatIsTheNext': 'ما هو التحرك التالي للجيش الهندي؟',
  'yesterday': 'الأمس',
  'whoIsShahRukh': 'من هو شاروخان؟',
  'march26': '26 مارس 2023',
  'howTolLearn': 'كيفية تعلم اللغة الإنجليزية؟',
  'march25': '25 مارس 2023',
  'isACourse': 'هل يلزم دورة في التصميم ليتم الحصول على...',
  'march24': '24 مارس 2023',
  'whatIsFull': 'ما هو الشكل الكامل لـ SGPA؟',
  'march23': '23 مارس 2023',



  'successfullyClear': 'تم مسحها بنجاح',
  'yourChatHistory': 'تم مسح سجل محادثاتك بنجاح.',
  'selectAll': 'تحديد الكل',
  'clearAll': 'مسح الكل',
  'inApp': 'شراء داخل التطبيق',
};
// TODO Implement this library.